<a href="https://colab.research.google.com/github/dineshkk15/hello-world/blob/main/Python/27_Pandas_Analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Analysis

In [ ]:
import pandas as pd
from datasets import load_dataset

dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

df

In [4]:
df.describe()

                     job_posted_date  salary_year_avg  salary_hour_avg
count                         785741     22003.000000     10662.000000
mean   2023-06-25 16:02:11.860248576    123286.274072        47.016598
min              2023-01-01 00:00:04     15000.000000         8.000000
25%              2023-03-20 10:05:48     90000.000000        27.500000
50%              2023-06-29 06:11:38    115000.000000        45.980000
75%              2023-09-27 01:01:16    150000.000000        61.159996
max              2023-12-31 23:59:58    960000.000000       391.000000
std                              NaN     48312.449482        21.890738

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 785741 entries, 0 to 785740
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        785741 non-null  object
 1   job_title              785740 non-null  object
 2   job_location           784696 non-null  object
 3   job_via                785733 non-null  object
 4   job_schedule_type      773074 non-null  object
 5   job_work_from_home     785741 non-null  bool
 6   search_location        785741 non-null  object
 7   job_posted_date        785741 non-null  datetime64[ns]
 8   job_no_degree_mention  785741 non-null  bool
 9   job_health_insurance   785741 non-null  bool
 10  job_country            785692 non-null  object
 11  salary_rate            33067 non-null   object
 12  salary_year_avg        22003 non-null   float64
 13  salary_hour_avg        10662 non-null   float64
 14  company_name           785723 non-null  object
 15  job_skills             668704 non-null  object
 16  job_type_skills        668704 non-null  object
dtypes: bool(3), datetime64[ns](1), float64(2), object(11)
memory usage: 86.2+ MB

In [6]:
df.count()

job_title_short          785741
job_title                785740
job_location             784696
job_via                  785733
job_schedule_type        773074
job_work_from_home       785741
search_location          785741
job_posted_date          785741
job_no_degree_mention    785741
job_health_insurance     785741
job_country              785692
salary_rate               33067
salary_year_avg           22003
salary_hour_avg           10662
company_name             785723
job_skills               668704
job_type_skills          668704
dtype: int64

In [7]:
df['salary_year_avg'].median()

115000.0

In [8]:
df['salary_year_avg'].min()

15000.0

In [11]:
min_salary = df['salary_year_avg'].idxmin()

In [10]:
df.iloc[min_salary]

job_title_short                                              Data Engineer
job_title                                           Data Engineer - Hadoop
job_location                                                        Brazil
job_via                                                       via LinkedIn
job_schedule_type                                                Full-time
job_work_from_home                                                   False
search_location                                                     Brazil
job_posted_date                                        2023-12-09 10:05:30
job_no_degree_mention                                                 True
job_health_insurance                                                 False
job_country                                                         Brazil
salary_rate                                                           year
salary_year_avg                                                    15000.0
salary_hour_avg                                                        NaN
company_name                                               Net2Source Inc.
job_skills               ['java', 'python', 'oracle', 'aws', 'hadoop', ...
job_type_skills          {'cloud': ['oracle', 'aws'], 'libraries': ['ha...
Name: 665729, dtype: object

In [12]:
df['job_title_short'].unique()

array(['Senior Data Engineer', 'Data Analyst', 'Data Engineer',
       'Business Analyst', 'Data Scientist', 'Machine Learning Engineer',
       'Senior Data Analyst', 'Cloud Engineer', 'Senior Data Scientist',
       'Software Engineer'], dtype=object)

In [13]:
df['job_title_short'].value_counts()

job_title_short
Data Analyst                 196075
Data Engineer                186241
Data Scientist               172286
Business Analyst              49063
Software Engineer             44929
Senior Data Engineer          44563
Senior Data Scientist         36957
Senior Data Analyst           29216
Machine Learning Engineer     14080
Cloud Engineer                12331
Name: count, dtype: int64

In [17]:
df.groupby('job_title_short')['salary_year_avg'].median()

job_title_short
Business Analyst              85000.0
Cloud Engineer                90000.0
Data Analyst                  90000.0
Data Engineer                125000.0
Data Scientist               127500.0
Machine Learning Engineer    106415.0
Senior Data Analyst          111175.0
Senior Data Engineer         147500.0
Senior Data Scientist        155500.0
Software Engineer             99150.0
Name: salary_year_avg, dtype: float64

In [19]:
df.groupby(['job_title_short', 'job_country'])['salary_year_avg'].median()

job_title_short    job_country
Business Analyst   Afghanistan        NaN
                   Albania            NaN
                   Algeria            NaN
                   Angola             NaN
                   Argentina      71100.0
                                   ...
Software Engineer  Venezuela          NaN
                   Vietnam        53600.0
                   Yemen              NaN
                   Zambia             NaN
                   Zimbabwe           NaN
Name: salary_year_avg, Length: 1387, dtype: float64

In [22]:
df.groupby('job_title_short')[['salary_year_avg', 'salary_hour_avg']].agg(['min', 'max', 'median'])

                          salary_year_avg            ... salary_hour_avg
                                      min       max  ...             max     median
job_title_short                                      ...
Business Analyst                  16500.0  387460.0  ...           132.5  40.362499
Cloud Engineer                    42000.0  280000.0  ...            91.0  40.000000
Data Analyst                      25000.0  650000.0  ...           391.0  32.615002
Data Engineer                     15000.0  525000.0  ...           184.5  58.500000
Data Scientist                    27000.0  960000.0  ...           237.5  47.500000
Machine Learning Engineer         30000.0  325000.0  ...            87.5  47.535000
Senior Data Analyst               30000.0  425000.0  ...           130.0  47.500000
Senior Data Engineer              35000.0  425000.0  ...           170.0  61.500000
Senior Data Scientist             45000.0  890000.0  ...           150.0  47.620003
Software Engineer                 28000.0  375000.0  ...           102.5  47.560001

[10 rows x 6 columns]

Load in the data.

In [ ]:
# Install datasets Library (if not already installed)
# !pip install -U datasets

# Importing Libraries
import pandas as pd
from datasets import load_dataset

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

## Descriptive Statistics

### Describe()

#### Notes

For a basic overview we'll be using `describe()`.
* It gets the following (for columns with numeric data):
  * count
  * mean
  * std
  * min
  * max
* Great for getting a quick overview of the basic stats for the table.
* It automatically skips NaN values.

#### Example

Use `describe()` on our DataFrame.

In [ ]:
df.describe()

                     job_posted_date  salary_year_avg  salary_hour_avg
count                         787686     22026.000000     10649.000000
mean   2023-06-25 00:10:18.590701056    123252.899602        47.009578
min              2022-12-31 06:01:15     15000.000000         8.000000
25%    2023-03-19 06:24:00.249999872     90000.000000        27.500000
50%       2023-06-28 13:03:44.500000    115000.000000        45.965000
75%              2023-09-26 14:26:56    150000.000000        61.159996
max              2023-12-31 06:12:38    960000.000000       391.000000
std                              NaN     48322.437693        21.871277

You can also use it on individual columns. If we just wanted to look at `salary_year_avg` then we'd do:

In [ ]:
df['salary_year_avg'].describe()

count     22026.000000
mean     123252.899602
std       48322.437693
min       15000.000000
25%       90000.000000
50%      115000.000000
75%      150000.000000
max      960000.000000
Name: salary_year_avg, dtype: float64

### Common Data Analysis Methods

#### Notes

But there are other methods like:
* `df.sum()` - Sum of values
* `df.cumsum()` - Cummulative sum of values
* `df.min()`/`df.max()` - Minimum/maximum values
* `df.idxmin()`/`df.idxmax()` - Indexes of minimum/Maximum value
* `df.mean()` - Mean of values
* `df.median()` - Median of values
* `df.mode()` - Mode of the values
* `series.value_counts()` - Counts of unique values for a Series (aka a column)
    * Typically used for counting *unique occurrences* within a single column.
    * It's not applicable to an entire DataFrame without specifying a column.
* Depending on the method, you can apply it directly to a DataFrame or a Series.

#### Examples

Let's get the count of the values in each column within the entire DataFrame.

In [ ]:
df.count()

job_title_short          787686
job_title                787685
job_location             786646
job_via                  787679
job_schedule_type        774976
job_work_from_home       787686
search_location          787686
job_posted_date          787686
job_no_degree_mention    787686
job_health_insurance     787686
job_country              787633
salary_rate               33073
salary_year_avg           22026
salary_hour_avg           10649
company_name             787668
job_skills               670364
job_type_skills          670364
dtype: int64

This is good to get a general overview of the DataFrame but it isn't that useful to us right now. Let's do some counts on specific columns:

Get the mode of the `'salary_year_avg'` column.

In [ ]:
df['salary_year_avg'].mode()

0    90000.0
Name: salary_year_avg, dtype: float64

Now we are going to get the index value of the max value of `salary_year_avg`.

In [ ]:
df['salary_year_avg'].idxmax()

752615

It gave us the index (row) = 357614. Remember how to get a row by the index number? We'll use `iloc` and inspect this.

It looks correct based on the maximum value we saw when using `describe()`.

In [ ]:
df.iloc[357614]

job_title_short                                     Data Analyst
job_title                                           Data Analyst
job_location             San JosÃ© Province, San JosÃ©, Costa Rica
job_via                                     via BeBee Costa Rica
job_schedule_type                                      Full-time
job_work_from_home                                         False
search_location                                       Costa Rica
job_posted_date                              2023-06-18 08:22:33
job_no_degree_mention                                      False
job_health_insurance                                       False
job_country                                           Costa Rica
salary_rate                                                 None
salary_year_avg                                              NaN
salary_hour_avg                                              NaN
company_name                                           TD SYNNEX
job_skills                                ['sql', 'r', 'python']
job_type_skills          {'programming': ['sql', 'r', 'python']}
Name: 357614, dtype: object

How about the *unique* count of job titles?

In [ ]:
df['job_title_short'].value_counts()

job_title_short
Data Analyst                 196593
Data Engineer                186678
Data Scientist               172727
Business Analyst              49160
Software Engineer             45019
Senior Data Engineer          44692
Senior Data Scientist         37076
Senior Data Analyst           29289
Machine Learning Engineer     14106
Cloud Engineer                12346
Name: count, dtype: int64

## Aggregation

### Groupby()

#### Notes

* Use `groupby` to group your DataFrame by the unique values in a specific column.
* Lets you perform aggregation (e.g. mean, sum) on the grouped data.
* Aggregations you can perform:
  * `mean()`: Computes the mean of the groups
  * `sum()`: Calculates the sum of the group values
  * `median()`: Finds the median of each group
  * `min()` and `max()`: Determine the minimum and maximum values within each group
  * Counts:
    * `count()`: Counts the number of non-NA/null entries in each group
    * `size()`: Returns the size of each group (including NA/null values)
  * `std()` and `var()`: Calculate the standard deviation and variance of groups
  * `first()` and `last()`: Get the first and last row of each group
  * `unique()`: Counts the number of unique non-NA/null values in each group

#### Examples

If we want to find the average yearly salary by `job_title_short`.

In [ ]:
df.groupby('job_title_short')['salary_year_avg'].mean()

job_title_short
Business Analyst              91191.520893
Cloud Engineer               111268.453846
Data Analyst                  93842.560714
Data Engineer                130182.584222
Data Scientist               136032.019578
Machine Learning Engineer    126728.314136
Senior Data Analyst          113850.304880
Senior Data Engineer         145932.118777
Senior Data Scientist        154112.680323
Software Engineer            112884.612303
Name: salary_year_avg, dtype: float64

What about the median of the salary by job title short?

In [ ]:
df.groupby('job_title_short')['salary_year_avg'].median()

job_title_short
Business Analyst              85000.0
Cloud Engineer                90000.0
Data Analyst                  90000.0
Data Engineer                125000.0
Data Scientist               128000.0
Machine Learning Engineer    106000.0
Senior Data Analyst          111175.0
Senior Data Engineer         147500.0
Senior Data Scientist        155000.0
Software Engineer             99150.0
Name: salary_year_avg, dtype: float64

### Agg()

#### Notes

* `agg()` lets you apply multiple functions at once.
* You can pass a list of functions to `agg()` to apply them all to the grouped data, or a dictionary to apply specific functions to specific columns.


#### Example

For each job title (`job_title_short`) let's get the minimum and maximum values for the salary.

In [ ]:
df.groupby('job_title_short')['salary_year_avg'].agg(['min', 'max'])

                               min       max
job_title_short
Business Analyst           16500.0  387460.0
Cloud Engineer             42000.0  280000.0
Data Analyst               25000.0  650000.0
Data Engineer              15000.0  525000.0
Data Scientist             27000.0  960000.0
Machine Learning Engineer  30000.0  325000.0
Senior Data Analyst        30000.0  425000.0
Senior Data Engineer       35000.0  425000.0
Senior Data Scientist      45000.0  890000.0
Software Engineer          28000.0  375000.0